In [1]:
import numpy as np
import pandas as pd

In [2]:
m = np.random.randint(1, 30, size=(5,3))

In [3]:
df1 = pd.DataFrame(m, columns=["var1", "var2", "var3"])

In [4]:
df2 = df1 + 99

In [6]:
pd.concat([df1, df2], ignore_index=True)

   var1  var2  var3
0    17    23    24
1     8    18    25
2    17    22    20
3    10    27    26
4    11    29     2
5   116   122   123
6   107   117   124
7   116   121   119
8   109   126   125
9   110   128   101

In [7]:
df1 = pd.DataFrame({'employees': ['john', 'dennis', 'mark', 'maria'],
                    'group': ['accounting', 'engineering', 'engineering', 'hr']})

In [9]:
df2 = pd.DataFrame({'employees': ['mark', 'john', 'dennis', 'maria'],
                    'start_date': [2010, 2009, 2014, 2019]})

In [14]:
df3 = pd.merge(df1, df2, on="employees")

In [15]:
df4 = pd.DataFrame({'group': ['accounting', 'engineering', 'hr'],
                    'manager': ['Caner', 'Mustafa', 'Berkcan']})

In [16]:
pd.merge(df3, df4)

  employees        group  start_date  manager
0      john   accounting        2009    Caner
1    dennis  engineering        2014  Mustafa
2      mark  engineering        2010  Mustafa
3     maria           hr        2019  Berkcan

In [17]:
series = pd.Series([1, 2, 3])

In [18]:
series ** 2

0    1
1    4
2    9
dtype: int64

In [19]:
dict = {"Paris": [10], "Berlin": [20]}

In [20]:
pd.DataFrame(dict)

   Paris  Berlin
0     10      20